// "use strict";
// // ! ДЗ 24.01 Створити змінну з іменем age і присвоїти їй значення свого віку. Вивести значення цієї змінної в консоль.
// const age = 15;
// console.log(age);

// //! Створити змінну з іменем name і присвоїти їй значення свого імені. Вивести значення цієї змінної в консоль.
// const name = "Kate";
// console.log(name);
// //! Створити змінну з іменем isStudent і присвоїти їй значення true або false, залежно від того, чи є студентом.
// //! Вивести значення цієї змінної в консоль.
// const isStudent = true;
// console.log(isStudent);

// //! Створити змінну з іменем myString і присвоїти їй рядок з вашої улюбленою цитатою.
// let myString = "Never Give Up";
// console.log(myString);

// // !Вивести цей рядок в консоль.
// //! Створити змінну з іменем myNumber і присвоїти їй довільне числове значення. Потім присвоїти цій змінній результат додавання до неї числа 10. Вивести значення myNumber в консоль.
// let myNumber = 28;
// console.log(myNumber + 10);
// // !Створити змінну з іменем myNull і присвоїти їй значення null. Вивести значення цієї змінної в консоль.
// let myNull = null;
// console.log(myNull);

// //! Д/з 27/01 Створити скрипт який виводить спливаюче вікно з запитом на введення імені користувача за допомогою prompt(). Після введення імені вивести повідомлення привітання з використанням введеного імені.

// // !  Створити скрипт який виводить спливаюче підтвердження за допомогою confirm(). Якщо користувач підтверджує дію, вивести повідомлення "Дякую за підтвердження!". Якщо користувач відмовляється, вивести повідомлення "Дію відмінено!".
// const answer = confirm("Confirm your action");
// if (answer) {
//   alert("Act is confirmed");
// } else {
//   alert("Act is mot confirmed");
// }
// console.log(answer);

// // !  Створити скрипт який виводить спливаюче попередження за допомогою alert(). Вивести повідомлення про те, що дія небезпечна та попросити користувача підтвердити дію за допомогою confirm(). Якщо користувач підтверджує дію, вивести повідомлення "Дякую за підтвердження!". Якщо користувач відмовляється, вивести повідомлення "Дію відмінено!".
// const dangerous = confirm(
//   "Act is dangerous! Please confirm if you want to continue"
// );
// if (dangerous) {
//   alert("Thank you");
// } else {
//   alert("Act is declined");
// }
// console.log(dangerous);
