"use strict";
// const answer = prompt("Виведить першe число");
// const price = "";
// answer = Number(answer);
// console.log(answer);
// let secondNumber = prompt("Виведить 2 число");
// secondNumber = Number(secondNumber);
// const total = answer + secondNumber;
// console.log(total);
// alert(total);

// !Створити змінні для зберігання температури за Цельсієм та Фаренгейтом. Перевести температуру з Цельсія у Фаренгейти за допомогою формули та вивести результат в консоль.
let Celcium = +"15";
const Farengate = Celcium * 2;
console.log(Farengate);
// !Створити змінну для зберігання кількості днів у місяці. Обчислити кількість годин та хвилин у цьому місяці за допомогою оператора множення та вивести результат в консоль.
const hours = +"696";
const minutes = +"41760";
let days = minutes / hours;
console.log(days);
// !Створити змінні для зберігання рівня здоров'я та енергії гравця в грі. Зменшити рівень здоров'я та енергії гравця за допомогою операторів віднімання та вивести результат в консоль.
// !Створити змінну для зберігання суми покупки в магазині. Застосувати знижку в розмірі 10% до цієї суми за допомогою оператора множення та вивести результат в консоль.
let price = +"10000";
const sale = +"0.9";
totalPrice = price * sale;
console.log(totalPrice);
// !Створити змінну для зберігання числа з плаваючою комою. Використати метод Math.floor() для округлення числа до меншого та вивести результат в консоль.
console.log(Math.floor(119.4));
// !Створити змінну для зберігання рядка, який містить числа з плаваючою комою. Використати метод parseFloat() для перетворення рядка у десяткове число та вивести результат в консоль.

let number = "128.20202981okjgtfc";
number = Number.parseFloat(number);
console.log(number);
console.log(typeof number);

// !Створити змінну для зберігання рядка, який містить ціле число. Використати метод parseInt() для перетворення рядка у ціле число та вивести результат в консоль.
let number = "128.20202981okjgtfc";
number = Number.parseInt(number);
console.log(number);
console.log(typeof number);
// !Створити змінну для зберігання числа. Використати метод Math.sqrt() для обчислення квадратного кореня числа та вивести результат в консоль.
console.log(Math.sqrt(3600));
// !Створити змінні для зберігання цілочисельного значення та рядка з числом у вигляді рядка. Використати метод parseInt() для перетворення рядка у ціле число та вивести результат в консоль. Потім використати метод toString() для перетворення цілочисельного значення у рядок та вивести результат в консоль.

let myNum = "367.098";
myNum = Number.parseInt(myNum);
console.log(myNum);
console.log(typeof myNum);
